//
//  GDBL_Account.h
//  New_GNaviServer
//
//  Created by yang yi on 12-3-26.
//  Copyright 2012 autonavi.com. All rights reserved.
//

#import <Foundation/Foundation.h>
#import "GDBL_Interface.h"
#import "Account.h"

#define PARSE_PARAMS_ERROR		@"PARAMS_ERROR"

#define NOTIFY_ACCOUNT		@"_NOTIFY_ACCOUNT"
#define ICALLNUM @"telprompt://4007715190"
//#define ICALLNUM @"telprompt://010-95190128"

//用户注册相关的返回值参考 0x00000020 开始 建议后期整合到GSTATUS中
#define	GD_ERR_ALREADY_LOGIN		0x00000021		//已登录
#define	GD_ERR_LOGIN_ERROR			0x00000022		//登录失败
#define	GD_ERR_USER_NOT_EXISTS		0x00000023		//帐户名不存在-登录
#define	GD_ERR_USER_NOT_ACTIVATE	0x00000024		//帐户未激活-登录
#define	GD_ERR_USER_EXISTS			0x00000025		//帐户名已存在-注册
#define	GD_ERR_EMAIL_EXISTS			0x00000026		//邮箱已存在-注册
#define	GD_ERR_TEL_EXISTS			0x00000027		//电话已存在-注册或修改帐户信息
#define	GD_ERR_PARAMS_ERROR			0x00000028		//参数错误
#define	GD_ERR_SEND_MAIL_ERROR		0x00000029		//发送邮件失败-取回密码

#define	GD_ERR_PARSE_ERROR			0x0000002a		//解析失败
#define GD_ERR_NETCONNECT_ERROR     0x0000002b		//网络连接失败
#define	GD_ERR_UNKNOWN_ERROR		0x0000002f		//未定义错误-容错处理

#define REQ_MZDM [NSString stringWithFormat:@"%@annex/iphonepage/user_register_v80/agreement.html",kNetDomain]
#define REQ_MZDM_TW [NSString stringWithFormat:@"%@annex/iphonepage/user_register_v80/agreement_tw.html",kNetDomain]
#define REQ_MZDM_EN [NSString stringWithFormat:@"%@annex/iphonepage/user_register_v80/agreement_en.html",kNetDomain]

@interface GDBL_Account : NSObject {

}

/**********************************************************************
 * 函数名称: GDBL_AccountUnBindToken
 * 功能描述: 注销-取消绑定TOKEN	 
 * 输入参数: 
 * 输出参数: 
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/03/26        1.0			杨毅
 **********************************************************************/
GSTATUS GDBL_AccountUnBindToken(void);

/**********************************************************************
 * 函数名称: GDBL_AccountLogout
 * 功能描述: 登出	 
 * 输入参数: 
 * 输出参数: 
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/03/26        1.0			杨毅
 **********************************************************************/
GSTATUS GDBL_AccountLogout(void);

/**********************************************************************
 * 函数名称: GDBL_ThirdLogin
 * 功能描述: 第三方登录	 
 * 输入参数: 
 tpuserid	第三方用户唯一码
 tpusername	第三方用户名
 tptype	第三方类型
 uuid	硬件唯一标识码
 sign	加密码
 * 输出参数: 
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/03/26        1.0			杨毅
 **********************************************************************/
GSTATUS GDBL_ThirdLogin (NSString *tpuserid,NSString *tpusername,NSString *uuid,NSString *sign,int type,NSString *token);

/**********************************************************************
 * 函数名称: GDBL_AccountLogin
 * 功能描述: 登录
 * 输入参数: 1.szAccountName
 2.szPwd
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/03/26        1.0			杨毅
 **********************************************************************/
GSTATUS GDBL_AccountLogin (NSString *phone,NSString *password,int type,NSString *uuid,NSString *token);

/**********************************************************************
 * 函数名称: GDBL_AccountResetPwd
 * 功能描述: 修改密码	 
 * 输入参数: 1.szOldPwd
 2.szNewPwd
 * 输出参数: 
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/03/26        1.0			杨毅
 **********************************************************************/
GSTATUS GDBL_AccountResetPwd (NSString *phone,NSString *newpw);

/**********************************************************************
 * 函数名称: GDBL_AccountModifyPwd
 * 功能描述: 修改密码
 * 输入参数:
 1.oldpw 旧密码
 2.newpw 新密码
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/03/26        1.0			杨毅
 **********************************************************************/
GSTATUS GDBL_AccountModifyPwd (NSString *oldpw,NSString *newpw,NSString *tpuserid,int tptype);

/**********************************************************************
 * 函数名称: GDBL_AccountSendEmail
 * 功能描述: 邮箱重置密码
 * 输入参数:
 1.email 邮箱
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2013/06/04        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_AccountSendEmail(NSString *email);

/**********************************************************************
 * 函数名称: GDBL_AccountGetProfile
 * 功能描述: 获取用户信息	 
 * 输入参数: 
 * 输出参数: 
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/03/26        1.0			杨毅
 **********************************************************************/
GSTATUS GDBL_AccountGetProfile(NSString *tpuserid,int tptype);

/**********************************************************************
 * 函数名称: GDBL_AccountRegist
 * 功能描述: 注册	 
 * 输入参数:	1.szUserName
 2.szPwd
 3.szEMail
 4.szPhone
 5.szAuthCode
 * 输出参数: 
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/03/26        1.0			杨毅
 **********************************************************************/
GSTATUS GDBL_AccountRegist(NSString *uuid,NSString *phone,NSString *szPwd,NSString *username,NSString *tpuserid,int tptype);


/**********************************************************************
 * 函数名称: GDBL_AccountAuthPic
 * 功能描述: 获取验证码图片	 
 * 输入参数:  
 * 输出参数: void* pImgData
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/03/26        1.0			杨毅
 **********************************************************************/
GSTATUS GDBL_AccountAuthPic(Gchar** pImgData, int* nLen);

/**********************************************************************
 * 函数名称: GDBL_GET_HEAD
 * 功能描述:  此接口用于用户下载头像图片
 * 输入参数:
 imagepath:下载图片的路径
 * 输出参数:
 image : 下载的图片
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/27        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_GET_HEAD(NSString* imagepath,Gchar** pImgData, int* nLen,NSString *tpuserid,int tptype);

/**********************************************************************
 * 函数名称: GDBL_UPLOAD_HEAD
 * 功能描述:   此接口用于用户上传头像。支持终端裁剪或者不裁剪，不裁剪的情况需终端给出裁剪区域，后台裁剪后的头像为50×50.
 上传文件格式限制：.jpg/.jpeg/.png/.gif'/.tiff'/.bmp
 上传文件大小限制：小于2M
 * 输入参数:
 image 上传图片
 out	输出格式
 left	图片裁剪区域左X
 top	图片裁剪区域上Y
 width	裁剪区域宽度
 height	裁剪区域高度
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/27        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_UPLOAD_HEAD(UIImage* image,int left,int top,int width,int height,NSString *tpuserid,int tptype);

/**********************************************************************
 * 函数名称: GDBL_GetPhoneCheckNumber
 * 功能描述: 此接口用于获取手机验证码，以支持后续的手机绑定。
 * 输入参数:
 phone:欲绑定11位手机号码
 uuid:mac地址或其他硬件唯一码识别字符串
 license_id:用于绑定此次验证码
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_GetPhoneCheckNumber(NSString *phone, NSString *uuid, NSString *license_id,int vtype,NSString *sign);

/**********************************************************************
 * 函数名称: GDBL_Get_95190_CheckNumber
 * 功能描述: 此接口用于获取手机验证码，以支持后续的手机绑定。
 * 输入参数:
 phone:欲绑定11位手机号码
 uuid:mac地址或其他硬件唯一码识别字符串
 license_id:用于绑定此次验证码
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_Get_95190_CheckNumber(NSString *phone, NSString *uuid, NSString *license_id,NSString *sign);

/**********************************************************************
 * 函数名称: GDBL_CheckCode
 * 功能描述: 此接口用于实现用户通过短信验证码进行下一步的注册
 * 输入参数:
 phone:欲绑定11位手机号码
 uuid:mac地址或其他硬件唯一码识别字符串
 license_id:用于绑定此次验证码
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_CheckCode(NSString *phone, NSString *uuid, NSString *license_id,NSString *license_val);


/**********************************************************************
 * 函数名称: GDBL_BIND_95190PHONE_NUMBER
 * 功能描述: 此接口用于实现客户端向服务端修改已绑定用于95190服务的电话号码。
 * 输入参数:  
 phone:欲绑定11位手机号码
 uuid:mac地址或其他硬件唯一码识别字符串
 license_id:用于绑定此次验证码
 license_val:手机短信收到的验证码
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_BIND_95190PHONE_NUMBER(NSString *phone, NSString *uuid, NSString *license_id, NSString *license_val);

/**********************************************************************
 * 函数名称: GDBL_Clear_95190PHONE_NUMBER
 * 功能描述: 此接口用于实现客户端向服务端解除已绑定用于95190服务的电话号码。
 * 输入参数:
 uuid:mac地址或其他硬件唯一码识别字符串

 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_Clear_95190PHONE_NUMBER(NSString *uuid);

/**********************************************************************
 * 函数名称: GDBL_GET_PHONE_NUMBER
 * 功能描述:  此接口用于实现客户端从服务端获取当前用户手机绑定情况。
 * 输入参数:
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_GET_PHONE_NUMBER(NSString *uuid);

/**********************************************************************
 * 函数名称: GDBL_GET_95190_DESTINATION
 * 功能描述:  此接口用于实现客户端从服务端获取当前用户通过95190设置的目的地。
 * 输入参数:
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_GET_95190_DESTINATION(NSString *uuid);

/**********************************************************************
 * 函数名称: GDBL_GET_95190_STATUS
 * 功能描述:  此接口用于实现客户端从服务端获取当前用户95190的服务状态。
 * 输入参数:
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_GET_95190_STATUS(NSString *uuid);

/**********************************************************************
 * 函数名称: GDBL_BUY_95190_SERVICE
 * 功能描述:   此接口用于实现客户端向服务端验证用户订购95190服务有效性。
 * 输入参数:
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_BUY_95190_SERVICE(NSString *phone, NSString *uuid,NSString *version,NSString *body,NSString *sign);

/**********************************************************************
 * 函数名称: GDBL_Account_Upadata_Profile
 * 功能描述:   此接口用于实现修改用户信息。
 * 输入参数: 
 NSString=nil，sex=0表示输入参数无效
 
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_Account_Upadata_Profile(NSString *nickName, NSString *url,NSString *province,NSString *city,NSString *birthday,NSString *signature,int sex,NSString *firstname,NSString *tpuserid,int tptype);

/**********************************************************************
 * 函数名称: GDBL_BIND_PHONE_NUMBER
 * 功能描述:  此接口用于旧用户绑定手机，绑定成功后可以用手机进行登录。
 * 输入参数:
 
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_BIND_PHONE_NUMBER(NSString *phone, NSString *uuid, NSString *license_id, NSString *license_val);

/**********************************************************************
 * 函数名称: GDBL_OLD_USER_BIND_PHONE_NUMBER
 * 功能描述: 此接口用于旧用户绑定手机，绑定成功后可以用手机进行登录。。
 * 输入参数:
 
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_OLD_USER_BIND_PHONE_NUMBER(NSString *phone);


/**********************************************************************
 * 函数名称: GDBL_FREE_95190
 * 功能描述:  此接口用于实现客户端向服务端申请使用95190免费30天服务。
 * 输入参数:
 
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/21        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_FREE_95190(NSString *phone, NSString *uuid,NSString *sign);

/**********************************************************************
 * 函数名称: GDBL_ORDER_EN_CHECK
 * 功能描述:  此接口用于实现客户端从服务端判断当前用户是否有英文版使用权限。
 * 输入参数:
 
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/27        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_ORDER_EN_CHECK(NSString *uuid);

/**********************************************************************
 * 函数名称: GDBL_PRE_CALL_95190
 * 功能描述:  此接口用于实现客户端通知服务端拨打95190电话。
 * 输入参数:
 
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/27        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_PRE_CALL_95190(NSString *phone);

/**********************************************************************
 * 函数名称: GDBL_GET_CURRENT95190_DES
 * 功能描述:  此接口用于实现客户端从服务端获取当前用户通过95190设置的目的地(拨打电话后设置),（拨打电话后获取刚设置的目的）。
 * 输入参数:
 
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/27        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_GET_CURRENT95190_DES(NSString *uuid);

/**********************************************************************
 * 函数名称: GDBL_GET_EN_TEXT
 * 功能描述:  此接口用于实现客户端从服务端获取英文版订购任务栏文字信息
 * 输入参数:
 
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/27        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_GET_EN_TEXT();

/**********************************************************************
 * 函数名称: GDBL_GET_95190_TEXT
 * 功能描述:  此接口用于实现客户端从服务端获取95190订购任务栏文字信息
 * 输入参数:
 
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/27        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_GET_95190_TEXT();

/**********************************************************************
 * 函数名称: GDBL_CANCLE_ALL_REQ
 * 功能描述:  此接口用于实现取消所有请求
 * 输入参数:
 
 * 输出参数:
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/27        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_CANCLE_ALL_REQ();

/**********************************************************************
 * 函数名称: GDBL_GetAccountInfo
 * 功能描述: 获取账号信息
 * 输入参数:
 
 * 输出参数: array
 
 数组顺序   取出类型            值说明
 0          int                登陆状态 0未登录，1老用户登录，2新用户登录，3新浪微博帐号登录，4腾讯微博帐号登录，5 新浪帐号绑定高德帐号 6 腾讯帐号绑定高德帐号
 1        NSString             账户名 (手机或者邮箱)
 2        NSString             密码
 3        NSString             昵称
 4         NSData              图片
 5        NSString             第三方uuid，若登陆状态为3或5，则是新浪UUID；若是4或6，则为腾讯UUID
 6        NSString             第三方账户名
 7        NSString             UserId      (必定有值)
 8        NSString             登陆令牌UserSId      (登陆后才有值)
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/27        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_GetAccountInfo(NSArray **array);

/**********************************************************************
 * 函数名称: GDBL_GetAccountInfo
 * 功能描述: 获取账号信息
 * 输入参数: array
 
 数组顺序   取出类型            值说明
 0          int                登陆状态 0未登录，1老用户登录，2新用户登录，3新浪微博帐号登录，4腾讯微博帐号登录，5 新浪帐号绑定高德帐号 6 腾讯帐号绑定高德帐号
 1        NSString             账户名 (手机或者邮箱)
 2        NSString             密码
 3        NSString             昵称
 4         NSData              图片
 5        NSString             第三方uuid，若登陆状态为3或5，则是新浪UUID；若是4或6，则为腾讯UUID
 6        NSString             第三方账户名
 7        NSString             UserId      (必定有值)
8        NSString             登陆令牌UserSId      (登陆后才有值)
 * 返 回 值: 成功返回GD_ERR_OK, 失败返回对应出错码
 * 修改日期			版本号		修改人		修改内容
 * ---------------------------------------------------------------------
 * 2012/12/27        1.0		高志闽
 **********************************************************************/
GSTATUS GDBL_setAccountInfo(NSArray *array);

/**
 *	回复默认值
 *
 *	@return	成功返回GD_ERR_OK, 失败返回对应出错码
 */
GSTATUS GDBL_clearAccountInfo();

/**
 *	保存用户头像至本地文件
 *
 *	@param	image	要保存的头像
 *
 *	@return	成功返回GD_ERR_OK, 失败返回对应出错码
 */
GSTATUS GDBL_setAccountImage(UIImage *image);

/**
 *	保存用户昵称至本地文件
 *
 *	@param	nickName	要保存的昵称
 *
 *	@return	成功返回GD_ERR_OK, 失败返回对应出错码
 */
GSTATUS GDBL_setAccountNickName(NSString *nickName);

/**
 *	保存用户userid至本地文件
 *
 *	@param	userid	要保存的userid
 *
 *	@return	成功返回GD_ERR_OK, 失败返回对应出错码
 */
GSTATUS GDBL_setAccountUserID(NSString *userid);

@end
