//
//  MWEngineSwitch.h
//  AutoNavi
//
//  Created by gaozhimin on 14-7-10.
//
//

#import <Foundation/Foundation.h>

/*!
  @brief 引擎中的开关,设置（如TMC，PCD，色盘） 包含逻辑
  */
@interface MWEngineSwitch : NSObject

/**
 **********************************************************************
 \brief 开启实时交通
 \parm bTip 是否有提示
 \details 开启实时交通
 **********************************************************************/
+ (GSTATUS)OpenTMCWithTip:(BOOL)bTip;


/**
 **********************************************************************
 \brief 开启实时交通
 \details 开启实时交通
 **********************************************************************/
+ (void)CloseTMC;

/**
 **********************************************************************
 \brief TMC是否开启
 \details TMC是否开启
 **********************************************************************/
+ (BOOL)isTMCOn;

/**
 **********************************************************************
 \brief 切换色盘
 \details 切换色盘
 **********************************************************************/
+ (void)switchTheme:(double)x withy:(double)y  withz:(double)z;

/*
 * @brief: 关闭plainmapmode
 */
+ (BOOL)ClosePlainMap;
@end
